Homework 1:

In [ ]:
import pandas as pd

data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Age': [25, 30, 35, 40], 'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']} 
df = pd.DataFrame(data)

  First Name  Age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

1.Rename column names using function. "First Name" --> "first_name", "Age" --> "age

In [5]:
df = df.rename(columns={'First Name':'first_name'})
df = df.rename(columns={'Age':'age'})
df

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

2. Print the first 3 rows of the DataFrame

In [6]:
df.head(3)

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles

3.Find the mean age of the individuals

In [10]:
age = df['age']
mean = age.mean()
print(mean)

32.5

4.Select and print only the 'Name' and 'City' columns

In [12]:
print(df[['first_name','City']])

  first_name           City
0      Alice       New York
1        Bob  San Francisco
2    Charlie    Los Angeles
3      David        Chicago

5.Add a new column 'Salary' with random salary values

In [15]:
import random

df['Salary'] = [random.randint(2000,5000) for x in range(len(df))]
df

  first_name  age           City  Salary
0      Alice   25       New York    2971
1        Bob   30  San Francisco    3292
2    Charlie   35    Los Angeles    2831
3      David   40        Chicago    3119

6.Display summary statistics of the DataFrame

In [17]:
df.describe()

             age       Salary
count   4.000000     4.000000
mean   32.500000  3053.250000
std     6.454972   197.892858
min    25.000000  2831.000000
25%    28.750000  2936.000000
50%    32.500000  3045.000000
75%    36.250000  3162.250000
max    40.000000  3292.000000

Homework 2:

1.Create a DataFrame named sales_and_expenses with columns 'Month', 'Sales', and 'Expenses', representing monthly sales and expenses data. Use below table.

In [18]:
data = {'Month':['Jan','Feb','Mar','Apr'],'Sales':[5000,6000,7000,8500],'Expenses':[3000,4500,5000,9000]}
df = pd.DataFrame(data)
df

  Month  Sales  Expenses
0   Jan   5000      3000
1   Feb   6000      4500
2   Mar   7000      5000
3   Apr   8500      9000

2.Calculate and display the maximum sales and expenses.

In [21]:
print(df['Sales'].max())
print(df['Expenses'].max())

8500
9000

3.Calculate and display the minimum sales and expenses.

In [22]:
print(df['Sales'].min())
print(df['Expenses'].min())

5000
3000

4.Calculate and display the average sales and expenses.

In [ ]:
print(df['Sales'].mean())
print(df['Expenses'].mean())

1. Create a DataFrame named expenses with columns 'Category', 'January', 'February', 'March', and 'April', representing monthly expenses for different categories. Use below table.

In [23]:
data = {'Category':['Rent','Utilities','Groceries','Entertainment'],'January':[1200,200,300,150],'Ferbruary':[1300,220,320,1600],'March':[1400,240,330,170],'April':[1500,250,350,180]}
df = pd.DataFrame(data)
df

        Category  January  Ferbruary  March  April
0           Rent     1200       1300   1400   1500
1      Utilities      200        220    240    250
2      Groceries      300        320    330    350
3  Entertainment      150       1600    170    180

In [27]:
df.set_index('Category',inplace=True)

In [28]:
df['Average'] = df.mean(axis=1)
df

               January  Ferbruary  March  April  Average
Category
Rent              1200       1300   1400   1500   1350.0
Utilities          200        220    240    250    227.5
Groceries          300        320    330    350    325.0
Entertainment      150       1600    170    180    525.0

In [29]:
df['Average'] = df.max(axis=1)
df

               January  Ferbruary  March  April  Average
Category
Rent              1200       1300   1400   1500   1500.0
Utilities          200        220    240    250    250.0
Groceries          300        320    330    350    350.0
Entertainment      150       1600    170    180   1600.0

In [30]:
df['Average'] = df.min(axis=1)
df

               January  Ferbruary  March  April  Average
Category
Rent              1200       1300   1400   1500   1200.0
Utilities          200        220    240    250    200.0
Groceries          300        320    330    350    300.0
Entertainment      150       1600    170    180    150.0